#+TITLE: Scripts

Aside from =nix= expressions, =floco= is driven by a collection of =bash=
scripts that drive builds, generate/update package definitions, and implement
the CLI.

In general these scripts make an effort to operate using a strictly minimal set
of utilities that are readily available on most UNIX systems.

** =install-module.sh=
This is used to install modules into a =node_modules/= directory or a
/FHS prefix/.
This routine is used internally by ~<floco>/builders/tree.nix~ but may also
be used as a regular executable for scripting outside of derivations.

#+BEGIN_SRC shell :exports both :results output
nix shell github:aakropotkin/floco#floco{-nix,-utils};
# Downloads and unpacks a module from an identifier/descriptor.
dlmod() {
  export PKG="$1";
  floco-nix eval --impure --raw --expr '( builtins.fetchTree {
    type = "tarball";
    url  = let
      res = builtins.npmResolve ( builtins.getEnv "PKG" );
      m   = builtins.match ".*\n([^\n]+)\n?" res;
    in if m == null then res else builtins.head m;
  } ).outPath';
}
# Hop into a temp area and install `semver' and its dependencies.
pushd "$( mktemp -d; )";
install-module.sh "$( dlmod "semver@7.3.8"; )" ./node_modules;
install-module.sh "$( dlmod "lru-cache@^6.0.0"; )" ./node_modules;
install-module.sh "$( dlmod "yallist@^4.0.0"; )" ./node_modules;
./node_modules/.bin/semver --help|head -n1;
TDIR="$PWD";
popd;
rm -rf "$TDIR";
#+END_SRC

#+RESULTS:
: SemVer 7.3.8

** =run-script.sh=
This is used to run a =package.json:.scripts.*= routine in the runtime
environment of ~node_modules/~.
This routine is equivalent to ~npm run~ or ~yarn run~.

Continuing the example above for =install-module.sh= ( before ~popd~ ),
we can replace ~./node_modules/.bin/semver --help|head -n1;~ with a script:
#+BEGIN_SRC shell :exports both :results output
# ...<SNIP>...
install-module.sh "$( dlmod "yallist@^4.0.0"; )" ./node_modules;

# Define and run a script.
echo '{
  "scripts": {
    "print-semver-version": "semver --help|head -n1",
    "print-node-version": "node --version"
  }
}' > ./package.json;
run-script.sh print-semver-version print-node-version;

TDIR="$PWD";
popd;
rm -rf "$TDIR";
#+END_SRC

#+RESULTS:
#+begin_example
SemVer 7.3.8
v18.12.1
#+end_example


